# =============================================================================
# Profile: Data Scientist
# Extensions installed by switch-profile.sh
# =============================================================================

# ── Theme ─────────────────────────────────────────────────────────────────────
# Catppuccin Latte: light pastel theme designed to reduce eye strain
Catppuccin.catppuccin-vsc
# Catppuccin icons: matching icon pack
Catppuccin.catppuccin-vsc-icons

# ── Python Core ───────────────────────────────────────────────────────────────
ms-python.python
ms-python.debugpy

# ── Astral Toolchain ──────────────────────────────────────────────────────────
# ty: type checker + language server (replaces Pylance/Pyright)
astral-sh.ty
# Ruff: linter + formatter (replaces black, flake8, isort)
charliermarsh.ruff

# ── Jupyter / Data Science ────────────────────────────────────────────────────
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-cell-tags
ms-toolsai.datawrangler
mechatroner.rainbow-csv

# ── Code Quality ──────────────────────────────────────────────────────────────
usernamehw.errorlens
njpwerner.autodocstring

# ── File Formats ──────────────────────────────────────────────────────────────
tamasfe.even-better-toml
redhat.vscode-yaml

# ── Diagrams ──────────────────────────────────────────────────────────────────
mermaidchart.vscode-mermaid-chart

# ── AI Agents ─────────────────────────────────────────────────────────────────
anthropic.claude-code
openai.chatgpt
Google.geminicodeassist
