# =============================================================================
# Profile: Software Engineer
# Extensions installed by switch-profile.sh
# Stack: TypeScript, React Native (Expo), Bun, ESLint + Prettier
# =============================================================================

# ── Theme ─────────────────────────────────────────────────────────────────────
Catppuccin.catppuccin-vsc
Catppuccin.catppuccin-vsc-icons

# ── ESLint + Prettier ─────────────────────────────────────────────────────────
# ESLint for linting (runs Prettier as a rule via eslint-plugin-prettier)
dbaeumer.vscode-eslint
# Prettier for formatting JS/TS/JSX/TSX/JSON/JSONC
esbenp.prettier-vscode

# ── Expo / React Native ───────────────────────────────────────────────────────
expo.vscode-expo-tools

# ── Bun ───────────────────────────────────────────────────────────────────────
oven.bun-vscode

# ── Code Quality ──────────────────────────────────────────────────────────────
usernamehw.errorlens

# ── File Formats ──────────────────────────────────────────────────────────────
redhat.vscode-yaml

# ── Diagrams ──────────────────────────────────────────────────────────────────
mermaidchart.vscode-mermaid-chart

# ── AI Agents ─────────────────────────────────────────────────────────────────
anthropic.claude-code
openai.chatgpt
google.geminicodeassist
