# =============================================================================
# Profile: Software Engineer
# Extensions installed by switch-profile.sh
# Stack: TypeScript, React Native (Expo), Bun, Biome
# =============================================================================

# ── Theme ─────────────────────────────────────────────────────────────────────
# Catppuccin Latte: light pastel theme designed to reduce eye strain
Catppuccin.catppuccin-vsc
# Catppuccin icons: matching icon pack
Catppuccin.catppuccin-vsc-icons

# ── Biome ─────────────────────────────────────────────────────────────────────
# Linter + formatter for JS/TS/JSX/TSX/JSON (replaces ESLint + Prettier)
biomejs.biome

# ── Expo / React Native ───────────────────────────────────────────────────────
expo.vscode-expo-tools

# ── Bun ───────────────────────────────────────────────────────────────────────
oven.bun-vscode

# ── Code Quality ──────────────────────────────────────────────────────────────
usernamehw.errorlens

# ── Code Quality ──────────────────────────────────────────────────────────────
usernamehw.errorlens

# ── File Formats ──────────────────────────────────────────────────────────────
redhat.vscode-yaml

# ── Diagrams ──────────────────────────────────────────────────────────────────
mermaidchart.vscode-mermaid-chart

# ── AI Agents ─────────────────────────────────────────────────────────────────
anthropic.claude-code
openai.chatgpt
Google.geminicodeassist
